#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.username: Refreshing state... [id=FAObvmJIPYWYUCzC]
random_password.password: Refreshing state... [id=none]
aws_db_parameter_group.default: Refreshing state... [id=techchallangeapp-rds-pg]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:470056619876:cluster/Playground-cluster]
aws_ssm_parameter.rds_username: Refreshing state... [id=/rds/techchallangeapp/username]
aws_eip.nat: Refreshing state... [id=eipalloc-0f689ed0bf7d961d2]
aws_vpc.main: Refreshing state... [id=vpc-0a4ac9c6c0618aa40]
aws_ssm_parameter.rds_password: Refreshing state... [id=/rds/techchallangeapp/password]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=techchallangeapp]
aws_iam_policy.ecs_autoscale_role_policy: Refreshing state... [id=arn:aws:iam::470056619876:policy/ecs-autoscale-role-policy]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs-task-execution-role]
aws_iam_role.ecs_autoscale_role: Refreshing state... [id=ecs-autoscale-role]
aws_iam_policy.ecs_execution_role_policy: Refreshing state... [id=arn:aws:iam::470056619876:policy/ecs-execution-role-policy]
aws_iam_role_policy_attachment.ecs_autoscale_role_attachement: Refreshing state... [id=ecs-autoscale-role-20220216044552471200000002]
aws_iam_role_policy_attachment.ecs_execution_role_attachement: Refreshing state... [id=ecs-task-execution-role-20220216044552462900000001]
aws_route_table.public: Refreshing state... [id=rtb-045cb8d24d2916d60]
aws_route_table.db-private: Refreshing state... [id=rtb-04fe66906d8450248]
aws_internet_gateway.internet_gw: Refreshing state... [id=igw-093f39f6576f3b93e]
aws_route_table.app-private: Refreshing state... [id=rtb-0e1328311f9759fdf]
aws_subnet.app_subnet[0]: Refreshing state... [id=subnet-03f59a2edfd75a4ef]
aws_subnet.public[2]: Refreshing state... [id=subnet-00af3504ec51d4bbc]
aws_subnet.public[1]: Refreshing state... [id=subnet-04c3e989fdc7440f2]
aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:470056619876:targetgroup/techchallangeapp-tg/d20a0be288d66c31]
aws_security_group.app_alb: Refreshing state... [id=sg-0af0a8ee71f4d9b69]
aws_subnet.public[0]: Refreshing state... [id=subnet-0ee4dd030d89a2122]
aws_subnet.app_subnet[1]: Refreshing state... [id=subnet-05a0421a79a775b76]
aws_subnet.app_subnet[2]: Refreshing state... [id=subnet-0cb732336333c64ab]
aws_subnet.db_subnet[0]: Refreshing state... [id=subnet-04c2c8716b108f637]
aws_subnet.db_subnet[1]: Refreshing state... [id=subnet-06734869904ba94a5]
aws_subnet.db_subnet[2]: Refreshing state... [id=subnet-0710d4f86821cb54f]
aws_route.internet: Refreshing state... [id=r-rtb-045cb8d24d2916d601080289494]
aws_nat_gateway.nat_gw: Refreshing state... [id=nat-085acc97b10de1c41]
aws_lb.app_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:470056619876:loadbalancer/app/application-loadbalancer/dba5694ab5eec9c3]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f3f29126ca7bdf3]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-064534ee397d89512]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02866285e0cafac5b]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0de2067f714f4321e]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-086fb9282778b5816]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-069f168614defd3ba]
aws_security_group.service_sg: Refreshing state... [id=sg-02fbe74ff887bdd8c]
aws_route_table_association.db-private[2]: Refreshing state... [id=rtbassoc-09c18f2c94311520d]
aws_route.nat: Refreshing state... [id=r-rtb-0e1328311f9759fdf1080289494]
aws_route_table_association.db-private[0]: Refreshing state... [id=rtbassoc-0f94cc1bba46cc7cb]
aws_route_table_association.db-private[1]: Refreshing state... [id=rtbassoc-06e79f48769f5e839]
aws_db_subnet_group.default: Refreshing state... [id=main]
aws_security_group.rds: Refreshing state... [id=sg-0aeb67553904b5d78]
aws_lb_listener.techchallange: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:470056619876:listener/app/application-loadbalancer/dba5694ab5eec9c3/f62e8603282cc8bd]
aws_db_instance.rds: Refreshing state... [id=techchallangeapp]
aws_lb_listener_rule.techchallange_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:470056619876:listener-rule/app/application-loadbalancer/dba5694ab5eec9c3/f62e8603282cc8bd/246ab920b600206d]
aws_ecs_task_definition.task: Refreshing state... [id=techchallangeapp]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:470056619876:service/Playground-cluster/techchallangeapp]
aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/Playground-cluster/techchallangeapp]
aws_appautoscaling_policy.ecs_up: Refreshing state... [id=scale_up-techchallangeapp]
aws_appautoscaling_policy.ecs_down: Refreshing state... [id=scale_down-techchallangeapp]
aws_cloudwatch_metric_alarm.service_cpu_high: Refreshing state... [id=cpu_utilization_high-techchallangeapp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/Playground-cluster/techchallangeapp"
      ~ role_arn           = "arn:aws:iam::470056619876:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::470056619876:role/ecs-autoscale-role"
        # (5 unchanged attributes hidden)
    }

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:ap-southeast-2:470056619876:service/Playground-cluster/techchallangeapp"
        name                               = "techchallangeapp"
        tags                               = {}
      ~ task_definition                    = "techchallangeapp:25" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:470056619876:task-definition/techchallangeapp:25" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ command          = [
                      - "updatedb",
                      - "-s",
                      + "serve",
                    ]
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "techchallangeapp" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
        tags                     = {
            "GitRepoName" = "application-terraform"
            "Group"       = "techchallangeapp"
            "Name"        = "techchallangeapp-task"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: out.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "out.plan"

```

</details>

*Pusher: @aruna-cande, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*